# CSE 10102-01 Elements of Computing II

Student Name: **Connor Smith**
<br>
Net ID: **csmith77**
<br>
Title: **Introduction to Pandas**

**Q1: Describe a Series object in your own words**

<blockquote>AnswerQ1: A series object is referece to how it is used in the code for this lab, is a list of values and their corresponding numbers in order of sequence. </blockquote>

<b>Q2: Create your own Series object. Write code the accomplishes the following tasks. Include code + comments. Assign unique index attributes for each series value, Access a series value(s) using the index label, Perform at least two unique arithmetic operations on the Series, Test for null values in your series. </b>

In [5]:
# import pandas package
import pandas as pd

# import Series and Data Frame components from pandas
from pandas import Series, DataFrame

# create a Series using pandas
obj = pd.Series([4, 7, -5, 3])

#Grater than zero
obj[obj > 0]

0    4
1    7
3    3
dtype: int64

In [4]:
# import pandas package
import pandas as pd

# import Series and Data Frame components from pandas
from pandas import Series, DataFrame

# create a Series using pandas
obj = pd.Series([4, 7, -5, 3])

#objects * 10"
obj * 10

0    40
1    70
2   -50
3    30
dtype: int64

In [8]:
# import pandas package
import pandas as pd

# import Series and Data Frame components from pandas
sdata = {'Four': 4, 'Seven': 7, 'Negative 5': -5, 'Three': 3}

# list of index labels
words = ['Two', 'Three', 'Four', 'Five']

# create Series from dict dictionary
obj2 = pd.Series(sdata, index=words)

print("True = null")

# see output for new obj2 series
pd.isnull(obj2)

True = null

Two       True
Three    False
Four     False
Five      True
dtype: bool

**Q3: Describe a DataFrame in your own words.**

<blockquote>AnswerQ3: A multitude of data that is entered at once using columns and their relations to the values they are associated with.</blockquote>

<b>Q4: Create your own small DataFrame. Write code that accomplishes the following tasks. Include code + comments.
- Change the original column order
- Select a specific column(s) using its index label or name attribute
- Select a specific row(s) using its index label or index value
- Remove a column from the DataFrame
- Determine summary statistics for values in the DataFrame</b>

In [10]:
#Original

# create dictionary with three equal-length lists
data = {'Name': ['Four', 'Seven', 'Negative Five', 'Three'], 
        'Number': [4, 7, -5, 3],
        'Half': [2, 3.5, -2.5, 1.5]}

# write data dictionary values to data frame
frame = pd.DataFrame(data)

# show newly-created frame
frame

            Name  Number  Half
0           Four       4   2.0
1          Seven       7   3.5
2  Negative Five      -5  -2.5
3          Three       3   1.5

In [11]:
#Change original order

# create dictionary with three equal-length lists
data = {'Name': ['Three', 'Seven', 'Negative Five', 'Four'], 
        'Number': [3, 7, -5, 4],
        'Half': [1.5, 3.5, -2.5, 2]}

# write data dictionary values to data frame
frame = pd.DataFrame(data)

# show newly-created frame
frame

            Name  Number  Half
0          Three       3   1.5
1          Seven       7   3.5
2  Negative Five      -5  -2.5
3           Four       4   2.0

In [19]:
#Select a Column

# create dictionary with three equal-length lists
data = {'Name': ['Four', 'Seven', 'Negative Five', 'Three'], 
        'Number': [4, 7, -5, 3],
        'Half': [2, 3.5, -2.5, 1.5]}

# write data dictionary values to data frame
frame = pd.DataFrame(data)

# show newly-created frame
frame['Name']

0             Four
1            Seven
2    Negative Five
3            Three
Name: Name, dtype: object

In [26]:
#Select a Row

# create dictionary with three equal-length lists
data = {'Name': ['Four', 'Seven', 'Negative Five', 'Three'], 
        'Number': [4, 7, -5, 3],
        'Half': [2, 3.5, -2.5, 1.5]}

# write data dictionary values to data frame
frame = pd.DataFrame(data)

# show newly-created frame
frame.iloc[0:1, :]

   Name  Number  Half
0  Four       4   2.0

In [29]:
#Remove a column

# create dictionary with three equal-length lists
data = {'Name': ['Four', 'Seven', 'Negative Five', 'Three'], 
        'Number': [4, 7, -5, 3],
        'Half': [2, 3.5, -2.5, 1.5]}

# write data dictionary values to data frame
frame = pd.DataFrame(data)

# show newly-created frame
del frame['Half']

frame

            Name  Number
0           Four       4
1          Seven       7
2  Negative Five      -5
3          Three       3

In [30]:
#Determine summary statistics for values in the DataFrame

# create dictionary with three equal-length lists
data = {'Name': ['Four', 'Seven', 'Negative Five', 'Three'], 
        'Number': [4, 7, -5, 3],
        'Half': [2, 3.5, -2.5, 1.5]}

# write data dictionary values to data frame
frame = pd.DataFrame(data)

# show newly-created frame
frame.info

<bound method DataFrame.info of             Name  Number  Half
0           Four       4   2.0
1          Seven       7   3.5
2  Negative Five      -5  -2.5
3          Three       3   1.5>

<b>Q5: Write code that loads in a different CSV file as a DataFrame and accomplishes each of the following tasks. Include code + comments.
- Shows the first five rows
- Shows the last five rows
- Checks the data types for each column
- Returns a technical summary for the DataFrame</b>

In [31]:
# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

In [32]:
# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [35]:
# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [37]:
# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [36]:
# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

**Q6: Write code that loads in a structured data file that uses a pipe symbol (|) as a delimiter. Include code + comments.**

In [6]:
# import pandas
import pandas as pd

# load a file that is delimited by the pipe
file = pd.read_csv("FILE_NAME", sep="|")

# shows first and last five rows of data frame
file

**Q7: Write code that loads in structured data file in which missing data values are represented by "?", "??", and "-" characters. Include code + comments.**

In [7]:
# import pandas
import pandas as pd

# load data where missing values are represented by NA or Null
file = pd.read_csv("FILE_NAME", na_values=['?', '??', '-'])

**Q8: Write code that ignores the last 6 rows of a structured data file. Include code + comments.**

In [7]:
# import pandas
import pandas as pd

# Skip the last 6 rows of the document
file = pd.read_csv("FILE_NAME", skip_footer[6])

**Q9: Write code that parses a structured data file in which commas "," are used as a thousands separator. Include code + comments**

In [ ]:
# import pandas
import pandas as pd

# Skip the last 6 rows of the document
file = pd.read_csv("FILE_NAME", thousands[','])

<b>Q10: Using the DataFrame you created for Q5, write code that executes AT LEAST FOUR of the following tasks. Include code + comments.
- Sorts a column by ascending values
- Sorts a column by descending values
- Selects a specific column in the DataFrame
- Creates a new DataFrame with select columns from existing DataFrame
- Uses a comparison operator to filter rows in the DataFrame
- Uses an isin statement to filter rows in the DataFrame
- Selects specific rows and columns
- Removes duplicate rows
- Removes rows with missing values
- Fills missing values using .fillna, ffill, or bfill</b>

In [ ]:
# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
tidy_Data-Locations_file

In [10]:
#Select a specific column in the DataFrame

# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file['team_name']

In [10]:
#Sorts a column by ascending values

# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file.info.sort_values(by=['team_name'])

In [10]:
#Sorts a column by descending values

# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file.info.sort_values(by=['team_name'], ascending=False)

In [10]:
#

# import pandas
import pandas as pd

# load Tidy_Data-Locations data from csv file
Tidy_Data-Locations_file = pd.read_csv("Tidy_Data-Locations.csv")

# show first 5 rows of newly-loaded dataframe
Tidy_Data-Locations_file.fillna('Not Specified')